IDEA Open Model
MaterialStrengthProperty Class
Compatible with IDEA StatiCa Beta 20.0
 Class defines the strength of material acc. to materieal thickness
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.OpenObject
 IdeaRS.OpenModel.Material.MaterialStrengthProperty
 Namespace: IdeaRS.OpenModel.Material
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.2
Syntax
public class MaterialStrengthProperty : OpenObject
Public Class MaterialStrengthProperty
	Inherits OpenObject
The MaterialStrengthProperty type exposes the following members.
Constructors
Name | Description
MaterialStrengthProperty
Initializes a new instance of the MaterialStrengthProperty class
Top
Properties
Name | Description
List
 Collection of material strength levels
Top
See Also
Reference
IdeaRS.OpenModel.Material Namespace